Revit 2027 API
UpdaterRegistry.IsUpdaterRegistered(UpdaterId, Document) Method
 Checks whether updater with the given id is registered in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsUpdaterRegistered(
	UpdaterId id,
	Document document
)
Public Shared Function IsUpdaterRegistered (
	id As UpdaterId,
	document As Document
) As Boolean
public:
static bool IsUpdaterRegistered(
	UpdaterId^ id,
	Document^ document
)
static member IsUpdaterRegistered :
        id : UpdaterId *
        document : Document -> bool
Parameters
id UpdaterId
 Id of the updater being tested.
document Document
 Document in which this updater is tested whether it's registered or not.
Return Value
Boolean
 Returns True if the updater is registered in the given document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UpdaterRegistry Class
IsUpdaterRegistered Overload
Autodesk.Revit.DB Namespace